# Taps
tap "oven-sh/bun"
tap "anomalyco/tap"

# Essential
brew "stow"
brew "git"
brew "curl"
brew "wget"
brew "perl"
brew "openssl"
brew "pkg-config"

# Core system
brew "zsh"
brew "neovim"
brew "tree"
brew "jq"
brew "htop"
brew "postgresql@15"
brew "bat"
brew "fd"
brew "fzf"
brew "zoxide"
brew "gh"
brew "rust"

# Node
brew "fnm"
brew "bun"

# Python
brew "python3"
brew "uv"

# Dev tools
brew "mosh"
brew "tmux"
brew "zellij"
brew "powerlevel10k"
brew "lazygit"

# AI tools
brew "gemini-cli"
brew "opencode"
